app/controllers/cds_controller.rb

SELECT * FROM "songs"
---
  def index
    @cds = Cd.all
    @songs = Song.all

SELECT * FROM "songs" WHERE (name LIKE '%%')
---
  def ac
    values = Cd.ac(params[:term]).collect{|name| {:value => name.id, :label => "#{name.name}", :category => "CDs"}} << Song.ac(params[:term]).collect{|name| {:value => name.id, :label => "#{name.name}", :category => "Songs"}}