app/controllers/songs_controller.rb

  def index
    @songs = Song.all
---
SELECT * FROM "songs"

  def show
    @song = Song.find(params[:id])
---
SELECT * FROM "songs" WHERE ("songs"."id" = 1)

  def create
    @song = Song.new(params[:song])
    if @song.save
---
INSERT INTO "songs" ("name", "created_at", "updated_at", "cd_id") VALUES('Song 1', '2011-03-28 20:07:34', '2011-03-28 20:07:34', NULL)